## Getting Started with pandas

pandas contains high-level data structures and manipulation tools designed to make data analysis fast and easy in Python. pandas is built on top of NumPy and makes it easy to use in NumPy-centric application.

### Introduction to pandas Data Structure

To get started with pandas, you will need to get comfortable with its two workhorse data structures <b>Series</b> and <b>DataFrame</b>. 
While they are not a universal solution for every problem, they provide a solid, easy-to-use basis for most applictions.

#### Series

A Series is a one-dimensional array-like object containing an array of data and an associated array of data labels, called its index.

In [5]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np
obj = Series([10, 20 , 30, 40])
obj

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
# you can get only the array representation using:
obj.values

array([10, 20, 30, 40], dtype=int64)

In [7]:
# you can get only the index represtation using:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
# getting value using index
obj[0]

10

In [9]:
# defining the index values
obj1 = Series([10, 20, 30, 40, 50], index=['b','a','c','d','e'])
obj1

b    10
a    20
c    30
d    40
e    50
dtype: int64

In [10]:
obj1.index

Index([u'b', u'a', u'c', u'd', u'e'], dtype='object')

In [11]:
obj1['a']

20

In [12]:
obj1['e']

50

In [13]:
obj1[['c', 'b', 'a']]

c    30
b    10
a    20
dtype: int64

NumPy array operations will preserve the index value link.

In [14]:
obj1[obj1 > 20]

c    30
d    40
e    50
dtype: int64

In [15]:
obj1 * 2

b     20
a     40
c     60
d     80
e    100
dtype: int64

In [16]:
np.exp(obj1)

b    2.202647e+04
a    4.851652e+08
c    1.068647e+13
d    2.353853e+17
e    5.184706e+21
dtype: float64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values. It can be substituted into many functions that expect a dict.

In [17]:
'b' in obj1

True

In [18]:
'f' in obj1

False

In [19]:
# you can create a Series using Python dic
dic ={'Ohio':123, 'Texas':456, 'Oregon':879, 'Utah':667}
obj2 = Series(dic)
obj2

Ohio      123
Oregon    879
Texas     456
Utah      667
dtype: int64

In [20]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj3 = Series(obj2, index = states)
obj3

California      NaN
Ohio          123.0
Oregon        879.0
Texas         456.0
dtype: float64

In [21]:
# using isnull function on Series
pd.isnull(obj3)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
pd.notnull(obj3)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [23]:
# or Series has this function
obj3.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
obj2

Ohio      123
Oregon    879
Texas     456
Utah      667
dtype: int64

In [25]:
obj3

California      NaN
Ohio          123.0
Oregon        879.0
Texas         456.0
dtype: float64

In [26]:
# adding two Series. It adds the values based on common key. You can perform other operations too.
obj2 + obj3

California       NaN
Ohio           246.0
Oregon        1758.0
Texas          912.0
Utah             NaN
dtype: float64

In [27]:
obj2

Ohio      123
Oregon    879
Texas     456
Utah      667
dtype: int64

In [28]:
# both Series object itself and its index have a name
obj2.name = 'population'
obj2.index.name = 'state'
obj2

state
Ohio      123
Oregon    879
Texas     456
Utah      667
Name: population, dtype: int64

In [29]:
obj

0    10
1    20
2    30
3    40
dtype: int64

In [30]:
# you can alter Series index in place
obj.index = ['u', 'v', 'x', 'y']
obj

u    10
v    20
x    30
y    40
dtype: int64

#### DataFrame

A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different valuetype (numeric, boolean, etc.) The DataFrame has both a row and column index, it can be though of as a dict of Series.

In [31]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year':[2000, 2001, 2002, 2001, 2002],       
        'pop':[1.5, 1.7, 3.6, 2.4, 2.9] 
       }
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [32]:
# you can specifiy the sequence of the columns
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [33]:
# As like Series, if you pass a column that isnt contained in data, it will appear with NA
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index =['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [34]:
frame2.index

Index([u'one', u'two', u'three', u'four', u'five'], dtype='object')

In [35]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [36]:
# returns a 2d array
frame2.values

array([[2000L, 'Ohio', 1.5, nan],
       [2001L, 'Ohio', 1.7, nan],
       [2002L, 'Ohio', 3.6, nan],
       [2001L, 'Nevada', 2.4, nan],
       [2002L, 'Nevada', 2.9, nan]], dtype=object)

In [37]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [38]:
type(frame2['state'])

pandas.core.series.Series

In [39]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [40]:
type(frame2.year)

pandas.core.series.Series

In [41]:
# retrieving rows using ix indexing field
frame2.ix['two']

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [42]:
type(frame2.ix['two'])

pandas.core.series.Series

In [43]:
# assigning values to a column 
frame2['debt'] = 16.6
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.6
two    2001    Ohio  1.7  16.6
three  2002    Ohio  3.6  16.6
four   2001  Nevada  2.4  16.6
five   2002  Nevada  2.9  16.6

In [44]:
frame2['debt'] = [10, 20, 15, 22, 32]
frame2

       year   state  pop  debt
one    2000    Ohio  1.5    10
two    2001    Ohio  1.7    20
three  2002    Ohio  3.6    15
four   2001  Nevada  2.4    22
five   2002  Nevada  2.9    32

In [45]:
frame2['debt'] = np.arange(5)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [46]:
# you can assign Series to DataFrame columns. The indices should match otherwise gets populated with NA
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [47]:
frame2['debit'] = val
frame2

       year   state  pop  debt  debit
one    2000    Ohio  1.5     0    NaN
two    2001    Ohio  1.7     1   -1.2
three  2002    Ohio  3.6     2    NaN
four   2001  Nevada  2.4     3   -1.5
five   2002  Nevada  2.9     4   -1.7

In [48]:
# assigning a column that does not exist will create a new column
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  debit eastern
one    2000    Ohio  1.5     0    NaN    True
two    2001    Ohio  1.7     1   -1.2    True
three  2002    Ohio  3.6     2    NaN    True
four   2001  Nevada  2.4     3   -1.5   False
five   2002  Nevada  2.9     4   -1.7   False

In [49]:
# deleting a column
del frame2['eastern']
frame2

       year   state  pop  debt  debit
one    2000    Ohio  1.5     0    NaN
two    2001    Ohio  1.7     1   -1.2
three  2002    Ohio  3.6     2    NaN
four   2001  Nevada  2.4     3   -1.5
five   2002  Nevada  2.9     4   -1.7

In [50]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt', u'debit'], dtype='object')

In [51]:
# Another common form of data is a nested dict of dicts format
pop = {'Nevada':{2001: 2.4, 2002: 2.9}, 'Ohio':{2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [52]:
# you can put this in DataFrame and it makes outer keys columns and inner keys indices
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [53]:
# you can transpose the DataFrame
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [54]:
# you can explicitly declare the indices
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

#### Index Objects

In [55]:
obj = Series(range(3), index =['a', 'b', 'c'])
index = obj.index
index

Index([u'a', u'b', u'c'], dtype='object')

In [56]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [57]:
index[1]

'b'

In [58]:
# index objects are immutable, so you cannot do:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [ ]:
# Immutability is important so that Index objects can be safely shared among data structures
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index = index)
obj2.index is index

In [ ]:
# In addition to being array-like, an index also functions as fixed-size set:
frame3

In [59]:
'Ohio' in frame3.columns

True

In [60]:
2003 in frame3.index

False

### Essential Functionality

#### Reindexing

In [61]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [62]:
# NA for index which does not exist
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [63]:
# you can fill the NA with any value 
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [64]:
# for ordered data like time series, it maybe desirable to do some interpolation or filling of values when reindexing
# use method option, ffill means forward filling, bfill means backward filling
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [65]:
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [66]:
# with DataFrame reindex can alter either the (row) index, columns or both.
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [67]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [68]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [69]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [70]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [71]:
states

['Texas', 'Utah', 'California']

In [72]:
# doing both index and columns reindexing in one shot
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill', columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [73]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [74]:
states

['Texas', 'Utah', 'California']

In [75]:
# you can accomplish the same thing by lablel indexing using ix
frame.ix[['a','b','c','d'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

#### Dropping entries from an axis

In [76]:
obj = Series(np.arange(5), index=['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [77]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [78]:
# just if I forgot to mention this you can use copy function on Series and DataFrames
copyObj = new_obj.copy
print
copyObj

<bound method Series.copy of a    0
b    1
d    3
e    4
dtype: int32>

In [79]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['Ohio','Colorado','Utah','New York'],
                                                columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [80]:
# this is a view no effect on data unless assigned to another variable
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [81]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [82]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

#### Indexing, selection and filtering

In [83]:
obj = Series(np.arange(4), index=['a','b','c','d'])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [84]:
obj['b']

1

In [85]:
obj[1]

1

In [86]:
obj[2:4]

c    2
d    3
dtype: int32

In [87]:
obj[['b','a','d']]

b    1
a    0
d    3
dtype: int32

In [88]:
obj[[1,3]]

b    1
d    3
dtype: int32

In [89]:
obj[obj < 2]

a    0
b    1
dtype: int32

In [90]:
# slicing with labels are different from normal Python slicing and as you can see the endpoint is inclusive
obj['b':'c']

b    1
c    2
dtype: int32

In [91]:
obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: int32

In [92]:
data = DataFrame(np.arange(16).reshape((4,4)),
                 index=['Ohio','Colorado','Utah','New York'],
                 columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
# these might be a bit inconsistence with previous examples
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [94]:
data[['two','three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [95]:
# selecting rows by slicing
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [96]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [97]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [98]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [99]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [100]:
# you can use ix property of data frame for mentioned operations too.
# please refer to DataFrame pandas reference

#### Arithmetic and data alignment

In [101]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a','c','d','e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [102]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a','c','e','f','g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [103]:
# indices not match NaN will be placed
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [104]:
df1 = DataFrame(np.arange(9).reshape((3,3)), columns=list('bcd'), index=['Ohio','Texas','Colorado'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [105]:
df2 = DataFrame(np.arange(12).reshape((4,3)), columns=list('bde'), index=['Utah','Ohio','Texas','Oregon'])
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [106]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [107]:
df1 = DataFrame(np.arange(12).reshape((3,4)), columns=list('abcd'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [108]:
df2 = DataFrame(np.arange(20).reshape((4,5)), columns=list('abcde'))
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [109]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [110]:
# populates the missing one on each DataFrame to zero
# this works for add, sub, div, mul
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [111]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [112]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [113]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

#### Operation between DataFrame and Series

In [114]:
arr = np.arange(12).reshape((4,3))
arr

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

In [115]:
arr[0]

array([0, 1, 2])

In [116]:
# this is called broadcasting, it subtracts row by row
arr - arr[0]

array([[0, 0, 0],
       [3, 3, 3],
       [6, 6, 6],
       [9, 9, 9]])

In [117]:
frame = DataFrame(np.arange(12).reshape((4,3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [118]:
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [119]:
# broadcasting down the rows
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [120]:
series2 = Series(range(3), index=['b','e','f'])
series2

b    0
e    1
f    2
dtype: int64

In [121]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [122]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [123]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [124]:
# you can do broadcasting on columns using arithmetic methods as follow
series3 = frame['d']
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [125]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

In [126]:
# subtraction
frame.sub(series3, axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

#### Function application and mapping

NumPy ufuncs work fine with pandas objects:

In [127]:
frame = DataFrame(np.random.randn(4, 3), columns=list('dbe'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               d         b         e
Utah   -1.741331  0.691189 -1.313803
Ohio   -0.844074  1.647858  0.236627
Texas   0.519366  0.135819 -1.163132
Oregon -1.006031 -0.020773  0.988999

In [128]:
np.abs(frame)

               d         b         e
Utah    1.741331  0.691189  1.313803
Ohio    0.844074  1.647858  0.236627
Texas   0.519366  0.135819  1.163132
Oregon  1.006031  0.020773  0.988999

Another frequent operation is applying a function on 1D array to each column or row

In [129]:
f = lambda x: x.max() - x.min()
# by default axis is zero
frame.apply(f)

d    2.260697
b    1.668631
e    2.302801
dtype: float64

In [130]:
frame.apply(f, axis = 1)

Utah      2.432520
Ohio      2.491931
Texas     1.682498
Oregon    1.995029
dtype: float64

Many of the most common array statistics (like sum and mean) are DataFrame methods, so using apply is not necessary.

apply need not return a scalar value, it can also return a Series with multiple values:

In [131]:
def f(x): return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            d         b         e
min -1.741331 -0.020773 -1.313803
max  0.519366  1.647858  0.988999

Elemenst-wise Python functions can be used too. Suppose you wanted to compute a formatted string from each floating point value in frame.

In [134]:
# old formatting way
pi = 3.14159
print(" pi = %1.2f " % pi)

 pi = 3.14

In [135]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            d      b      e
Utah    -1.74   0.69  -1.31
Ohio    -0.84   1.65   0.24
Texas    0.52   0.14  -1.16
Oregon  -1.01  -0.02   0.99

The reason for the name applymap is that Series has a map method for applying an element-wise function:

In [136]:
frame['e'].map(format)

Utah      -1.31
Ohio       0.24
Texas     -1.16
Oregon     0.99
Name: e, dtype: object

#### Sorting

In [137]:
obj = Series(range(4), index=['d','a','b','c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [138]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [139]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three','one'], columns=['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [140]:
# default axis is 0
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [141]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [142]:
# sorting a Series by its values
obj = Series([4,7,-3,2])
obj.order()

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:3: FutureWarning: order is deprecated, use sort_values(...)
  app.launch_new_instance()

2   -3
3    2
0    4
1    7
dtype: int64

In [143]:
# any missing values are sorted to the end of the Series by default
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.order()

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:3: FutureWarning: order is deprecated, use sort_values(...)
  app.launch_new_instance()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [144]:
frame = DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [145]:
frame.sort_index(by='b')

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [146]:
frame.sort_index(by=['a','b'])

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

#### Summarizing and Computing Descriptive Statistics

In [147]:
df = DataFrame([[1.4,np.nan], [7.1,-4.5],
               [np.nan, np.nan], [0.75, -1.3]],
               index=['a','b','c','d'],
               columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [148]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [149]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [150]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [151]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [152]:
# on non-numeric, it produces alternative summary statistics:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [153]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

Some summary statistics and related functions:

count<br />
describe<br />
min, max<br />
quantile<br />
sum<br />
mean<br />
median<br />
mad<br />
var<br />
std<br />
diff<br />
pct_change<br />
cumsum<br />
cumprod<br />

#### Correlation and Covariance

Covariance measures how two variables move together. It measures whether the two move in the same direction (a positive covariance) or in opposite directions. (a negative covariance) Ranges between(-inf, +inf)

Finding that two variables have a high or low covariance might not be a useful metric on its own. Covariance can tell how the two variables move together, but to determine the strength of the relationship, we need to look at the correlation.

Correlation between two variables X and Y is simply the covariance between both variables divided by the product of the standard deviation of the variables X and Y. Ranges between [-1, 1]

In [157]:
# getting stock data from Yahoo
import pandas_datareader.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.iteritems()})

volume = DataFrame({tic: data['Volume']
                   for tic, data in all_data.iteritems()})

returns = price.pct_change()

returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2017-02-13  0.008856  0.006846  0.003806  0.011250
2017-02-14  0.012979  0.001477  0.004293  0.003731
2017-02-15  0.003629 -0.001792  0.008605 -0.000619
2017-02-16 -0.001181  0.006325 -0.001376 -0.000155
2017-02-17  0.002734  0.004744 -0.004189  0.001550

In [158]:
# corrolation between MSFT and IBM stocks
returns.MSFT.corr(returns.IBM)

0.49520651158693813

In [159]:
# covariance between MSFT and IBM stcoks
returns.MSFT.cov(returns.IBM)

8.607647797131351e-05

In [160]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.409525  0.381606  0.389047
GOOG  0.409525  1.000000  0.402953  0.470850
IBM   0.381606  0.402953  1.000000  0.495207
MSFT  0.389047  0.470850  0.495207  1.000000

In [161]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000270  0.000105  0.000075  0.000093
GOOG  0.000105  0.000244  0.000076  0.000107
IBM   0.000075  0.000076  0.000144  0.000086
MSFT  0.000093  0.000107  0.000086  0.000210

In [162]:
returns.corrwith(returns.IBM)

AAPL    0.381606
GOOG    0.402953
IBM     1.000000
MSFT    0.495207
dtype: float64

In [163]:
# finding corrolation between price change and volume
returns.corrwith(volume)

AAPL   -0.074063
GOOG   -0.009616
IBM    -0.194337
MSFT   -0.091296
dtype: float64

#### Unique Values, Value Counts, and Membership

In [164]:
obj = Series(['c','a','d','a','a','b','b','c','c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [165]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [166]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [167]:
# panda has method for this too that can be used for any array or sequence
pd.value_counts(obj.values)

c    3
a    3
b    2
d    1
dtype: int64

In [168]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [169]:
# isin is responsible for vectorized set memebership and can be very useful in filtering a data set
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [170]:
data = DataFrame({'Qu1': [1,3,4,5,4],
                  'Qu2': [2,3,1,2,3],
                  'Qu3': [1,5,2,4,4]})

data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    5    2    4
4    4    3    4

#### Handling Missing Data

In [171]:
# pandas uses the floating point value NaN to represent missing data
string_data = Series(['aardvark', 'artichoke', np.nan, 'avacado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avacado
dtype: object

In [172]:
# built-in Python None value is also treated as NaN
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

#### Filtering Out Missing Data

In [173]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [174]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [175]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [176]:
data = DataFrame([[1, 6.5, 3], [1, NA, NA],
                 [NA, NA, NA], [NA, 6.5, 3]])

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [177]:
cleaned = data.dropna()

In [178]:
# any row with NA will be dropped
cleaned

     0    1    2
0  1.0  6.5  3.0

In [179]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [180]:
# if all row has NA
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [181]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [182]:
data[2] = NA
data

     0    1   2
0  1.0  6.5 NaN
1  1.0  NaN NaN
2  NaN  NaN NaN
3  NaN  6.5 NaN

In [183]:
# drop the column if all NA
data.dropna(how='all', axis = 1)

     0    1
0  1.0  6.5
1  1.0  NaN
2  NaN  NaN
3  NaN  6.5

In [184]:
df = DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.497626  0.254197 -0.728105
1  1.090259 -1.082705  0.662012
2  0.090478 -0.468684 -0.044517
3 -1.218711  0.288075 -1.128632
4 -0.721820  0.356742  0.347113
5  0.297959  0.591111 -2.023776
6 -0.970656 -0.891095 -1.206222

In [185]:
# rememeber! ix slicing includes the upper bound
df.ix[:4, 1] = NA
df.ix[:2, 2] = NA
df

          0         1         2
0 -0.497626       NaN       NaN
1  1.090259       NaN       NaN
2  0.090478       NaN       NaN
3 -1.218711       NaN -1.128632
4 -0.721820       NaN  0.347113
5  0.297959  0.591111 -2.023776
6 -0.970656 -0.891095 -1.206222

In [186]:
# keep only rows having certain number of observations
df.dropna(thresh=3)

          0         1         2
5  0.297959  0.591111 -2.023776
6 -0.970656 -0.891095 -1.206222

#### Filling in Missing Data

In [187]:
df

          0         1         2
0 -0.497626       NaN       NaN
1  1.090259       NaN       NaN
2  0.090478       NaN       NaN
3 -1.218711       NaN -1.128632
4 -0.721820       NaN  0.347113
5  0.297959  0.591111 -2.023776
6 -0.970656 -0.891095 -1.206222

In [188]:
df.fillna(0)

          0         1         2
0 -0.497626  0.000000  0.000000
1  1.090259  0.000000  0.000000
2  0.090478  0.000000  0.000000
3 -1.218711  0.000000 -1.128632
4 -0.721820  0.000000  0.347113
5  0.297959  0.591111 -2.023776
6 -0.970656 -0.891095 -1.206222

In [189]:
df

          0         1         2
0 -0.497626       NaN       NaN
1  1.090259       NaN       NaN
2  0.090478       NaN       NaN
3 -1.218711       NaN -1.128632
4 -0.721820       NaN  0.347113
5  0.297959  0.591111 -2.023776
6 -0.970656 -0.891095 -1.206222

In [190]:
# use a dic which indicates what to fill NA at each column
df.fillna({1:0.5, 2: -1})

          0         1         2
0 -0.497626  0.500000 -1.000000
1  1.090259  0.500000 -1.000000
2  0.090478  0.500000 -1.000000
3 -1.218711  0.500000 -1.128632
4 -0.721820  0.500000  0.347113
5  0.297959  0.591111 -2.023776
6 -0.970656 -0.891095 -1.206222

In [191]:
df

          0         1         2
0 -0.497626       NaN       NaN
1  1.090259       NaN       NaN
2  0.090478       NaN       NaN
3 -1.218711       NaN -1.128632
4 -0.721820       NaN  0.347113
5  0.297959  0.591111 -2.023776
6 -0.970656 -0.891095 -1.206222

In [192]:
# fillna returns a new object, but you can modify the existing object in place
df.fillna(0, inplace=True)
df

          0         1         2
0 -0.497626  0.000000  0.000000
1  1.090259  0.000000  0.000000
2  0.090478  0.000000  0.000000
3 -1.218711  0.000000 -1.128632
4 -0.721820  0.000000  0.347113
5  0.297959  0.591111 -2.023776
6 -0.970656 -0.891095 -1.206222

In [193]:
df = DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -1.904581 -0.996041  1.249286
1 -0.317049  1.212832  0.500323
2  0.991508 -0.187973 -0.128680
3 -0.360596 -1.564816 -0.063088
4 -1.838754  1.463288 -1.023817
5  0.843031  0.941192 -0.643180

In [194]:
df.ix[2:,1] = NA
df.ix[4:,2] = NA
df

          0         1         2
0 -1.904581 -0.996041  1.249286
1 -0.317049  1.212832  0.500323
2  0.991508       NaN -0.128680
3 -0.360596       NaN -0.063088
4 -1.838754       NaN       NaN
5  0.843031       NaN       NaN

In [195]:
# forward filling
df.fillna(method='ffill')

          0         1         2
0 -1.904581 -0.996041  1.249286
1 -0.317049  1.212832  0.500323
2  0.991508  1.212832 -0.128680
3 -0.360596  1.212832 -0.063088
4 -1.838754  1.212832 -0.063088
5  0.843031  1.212832 -0.063088

In [196]:
df

          0         1         2
0 -1.904581 -0.996041  1.249286
1 -0.317049  1.212832  0.500323
2  0.991508       NaN -0.128680
3 -0.360596       NaN -0.063088
4 -1.838754       NaN       NaN
5  0.843031       NaN       NaN

In [197]:
# you can put a limit of how many to fill
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.904581 -0.996041  1.249286
1 -0.317049  1.212832  0.500323
2  0.991508  1.212832 -0.128680
3 -0.360596  1.212832 -0.063088
4 -1.838754       NaN -0.063088
5  0.843031       NaN -0.063088

In [198]:
# With fillna you can do lots of other things with a little creativity
data = Series([1, NA, 3.5, NA, 7])
# putting mean of values for NAs
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64